def show_menu():
    n = 26
    print('+-------------------------------+')
    print("| 1)添加学生信息".ljust(n) + '|')
    print("| 2)显示学生信息".ljust(n) + '|')
    print("| 3)删除学生信息".ljust(n) + '|')
    print("| 4)修改学生成绩".ljust(n) + '|')
    print("| 5)按学生成绩高~低显示学生信息".ljust(n-7) + '|')
    print("| 6)按学生成绩低~高显示学生信息".ljust(n-7) + '|')
    print("| 7)按学生年龄高~低显示学生信息".ljust(n-7) + '|')
    print("| 8)按学生年龄低~高显示学生信息".ljust(n-7) + '|')
    print("| 9)从文件读入学生信息".ljust(n-3) + '|')
    print("| 10)将学生信息添加到文件".ljust(n-4) + '|')


    print("| q)退出".ljust(n+4) + '|')
    print('+-------------------------------+')

#show_menu()